### Terraform Plan: `prod/app`
```
Acquiring state lock. This may take a few moments...
data.terraform_remote_state.base: Reading...
module.compute.data.aws_ami.ubuntu_arm64: Reading...
module.compute.data.aws_ami.ubuntu_x86: Reading...
module.compute.aws_iam_role.ec2_ssm: Refreshing state... [id=doktori-prod-ec2-ssm]
module.compute.aws_iam_role_policy_attachment.ssm_managed: Refreshing state... [id=doktori-prod-ec2-ssm-20260221130336685900000002]
module.compute.aws_iam_role_policy.ec2_ecr_pull: Refreshing state... [id=doktori-prod-ec2-ssm:doktori-prod-ec2-ecr-pull]
module.compute.aws_iam_instance_profile.ec2_ssm: Refreshing state... [id=doktori-prod-ec2-ssm]
module.compute.aws_iam_role_policy.ec2_parameter_store: Refreshing state... [id=doktori-prod-ec2-ssm:doktori-prod-ec2-ssm-params]
module.compute.aws_iam_role_policy.ec2_s3_access[0]: Refreshing state... [id=doktori-prod-ec2-ssm:doktori-prod-ec2-s3]
module.compute.data.aws_ami.ubuntu_x86: Read complete after 0s [id=ami-04d25ae66444b2b10]
module.compute.data.aws_ami.ubuntu_arm64: Read complete after 0s [id=ami-067069a366ec13118]
data.terraform_remote_state.base: Read complete after 2s
module.compute.aws_security_group.this["chat"]: Refreshing state... [id=sg-069d12b9756fdd387]
module.compute.aws_security_group.this["front"]: Refreshing state... [id=sg-02ad17c30943eefaa]
module.compute.aws_security_group.this["api"]: Refreshing state... [id=sg-0bd88a786e5f24df3]
module.compute.aws_security_group.this["ai"]: Refreshing state... [id=sg-0cdfebdb95267e1ed]
module.compute.aws_security_group.this["rds_monitoring"]: Refreshing state... [id=sg-084e6132254526799]
module.compute.aws_security_group.this["nginx"]: Refreshing state... [id=sg-00eec5f108aeb77dd]
module.compute.aws_eip.this["nginx"]: Refreshing state... [id=eipalloc-050b53aa9215180a8]
module.compute.aws_security_group_rule.cross["api-from-nginx-8080"]: Refreshing state... [id=sgrule-2634594532]
module.compute.aws_security_group_rule.cross["ai-from-nginx-8000"]: Refreshing state... [id=sgrule-155257288]
module.compute.aws_security_group_rule.cross["chat-from-nginx-8081"]: Refreshing state... [id=sgrule-1921353110]
module.compute.aws_security_group_rule.cross["front-from-nginx-3000"]: Refreshing state... [id=sgrule-3760327133]
module.compute.aws_instance.this["nginx"]: Refreshing state... [id=i-0a4beef9dba096fc0]
module.compute.aws_instance.this["api"]: Refreshing state... [id=i-01d309282ecfb432b]
module.compute.aws_instance.this["rds_monitoring"]: Refreshing state... [id=i-0c81b7ef906b11f9c]
module.compute.aws_instance.this["chat"]: Refreshing state... [id=i-0191fb29b83c5f845]
module.compute.aws_instance.this["front"]: Refreshing state... [id=i-0212b65a2dfba8335]
module.compute.aws_instance.this["ai"]: Refreshing state... [id=i-0bc2413c68025b682]
module.compute.aws_eip_association.this["nginx"]: Refreshing state... [id=eipassoc-06d302653508a672e]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_route53_record.service["ai"] will be created
  + resource "aws_route53_record" "service" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "ai.prod.doktori.internal"
      + records         = [
          + "10.1.20.199",
        ]
      + ttl             = 300
      + type            = "A"
      + zone_id         = "Z04783583MC5PWNZP04CM"
    }

  # aws_route53_record.service["api"] will be created
  + resource "aws_route53_record" "service" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "api.prod.doktori.internal"
      + records         = [
          + "10.1.21.111",
        ]
      + ttl             = 300
      + type            = "A"
      + zone_id         = "Z04783583MC5PWNZP04CM"
    }

  # aws_route53_record.service["chat"] will be created
  + resource "aws_route53_record" "service" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "chat.prod.doktori.internal"
      + records         = [
          + "10.1.30.247",
        ]
      + ttl             = 300
      + type            = "A"
      + zone_id         = "Z04783583MC5PWNZP04CM"
    }

  # aws_route53_record.service["front"] will be created
  + resource "aws_route53_record" "service" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "front.prod.doktori.internal"
      + records         = [
          + "10.1.30.216",
        ]
      + ttl             = 300
      + type            = "A"
      + zone_id         = "Z04783583MC5PWNZP04CM"
    }

  # aws_route53_record.service["nginx"] will be created
  + resource "aws_route53_record" "service" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "nginx.prod.doktori.internal"
      + records         = [
          + "10.1.3.104",
        ]
      + ttl             = 300
      + type            = "A"
      + zone_id         = "Z04783583MC5PWNZP04CM"
    }

  # aws_route53_record.service["rds_monitoring"] will be created
  + resource "aws_route53_record" "service" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "rds-exporter.prod.doktori.internal"
      + records         = [
          + "10.1.0.14",
        ]
      + ttl             = 300
      + type            = "A"
      + zone_id         = "Z04783583MC5PWNZP04CM"
    }

Plan: 6 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"

```